Здравствуйте, Александр!

Отправление № 05863439-0001-1 поступило в службу доставки в Вашем городе.

Если Вы оформили заказ на условиях курьерской доставки, то в ближайшее время с Вами свяжутся сотрудники курьерской компании и согласуют дату и время доставки заказа.

Если Вы оформили заказ на условиях получения в пункте выдачи, Вы можете забрать свой заказ в удобное для Вас время, согласно графику работы пункта выдачи.

Информация о пункте выдачи заказов:
Пункт выдачи заказов OZON.ru в г. Екатеринбург "Космонавтов".
Адрес: г. Екатеринбург, ул. Космонавтов, 51, магазин "Мирослава", пав. "Мир Фото"
Телефон: (343) 370-45-63, (912) 605-80-76
Время работы: Понедельник - воскресенье с 9 до 21 часа, перерыв с 13.30-14 без выходных
Срок доставки заказа: 4-5 рабочих дней после отгрузки со склада в Москве.
Сразу после поступлении Вашего заказа в пункт выдачи Вашего города, Вы будете уведомлены об этом по телефону, электронной почте и СМС. (СМС отправляется только для заказов самовывозом, и только если Вы подписаны на данную услугу на сайте)